#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
github_team.teams["continuous-integration"]: Refreshing state... [id=6847099]
github_team.teams["tech-lead"]: Refreshing state... [id=6847098]
github_team.teams["infrastructure"]: Refreshing state... [id=6847100]
github_membership.users["wigman"]: Refreshing state... [id=Mage-OS:wigman]
github_team.teams["distribution"]: Refreshing state... [id=6847101]
github_team.teams["content"]: Refreshing state... [id=6847102]
github_membership.users["Vinai"]: Refreshing state... [id=Mage-OS:Vinai]
github_membership.users["johnhughes1984"]: Refreshing state... [id=Mage-OS:johnhughes1984]
github_membership.users["damienwebdev"]: Refreshing state... [id=Mage-OS:damienwebdev]
github_membership.users["mage-os-ci"]: Refreshing state... [id=Mage-OS:mage-os-ci]
github_membership.users["sprankhub"]: Refreshing state... [id=Mage-OS:sprankhub]
github_repository.mirrors["mirror-inventory"]: Refreshing state... [id=mirror-inventory]
github_repository.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=mirror-commerce-data-export]
github_repository.mirrors["mirror-zf1"]: Refreshing state... [id=mirror-zf1]
github_repository.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=mirror-module-configurable-sample-data-venia]
github_repository.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=mirror-adobe-stock-integration]
github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mirror-composer-dependency-version-audit-plugin]
github_repository.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=mirror-magento-composer-installer]
github_repository.mirrors["mirror-composer"]: Refreshing state... [id=mirror-composer]
github_repository.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=mirror-magento2-page-builder]
github_repository.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=mirror-magento2-sample-data]
github_repository.mirrors["mirror-security-package"]: Refreshing state... [id=mirror-security-package]
github_repository.mirrors["mirror-devdocs"]: Refreshing state... [id=mirror-devdocs]
github_repository.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=mirror-inventory-composer-installer]
github_repository.mirrors["mirror-magento2"]: Refreshing state... [id=mirror-magento2]
github_repository.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=mirror-composer-root-update-plugin]
github_repository.mirrors["mirror-page-builder-types"]: Refreshing state... [id=mirror-page-builder-types]
github_repository.mirrors["mirror-adobe-ims"]: Refreshing state... [id=mirror-adobe-ims]
github_repository.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin]
github_repository.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin]
github_repository.repositories["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js]
github_repository.repositories["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export]
github_repository.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer]
github_repository.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration]
github_repository.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data]
github_repository.repositories["terraform"]: Refreshing state... [id=terraform]
github_repository.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer]
github_repository.repositories["mageos-security-package"]: Refreshing state... [id=mageos-security-package]
github_repository.repositories["mageos-magento2"]: Refreshing state... [id=mageos-magento2]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["mageos-inventory"]: Refreshing state... [id=mageos-inventory]
github_repository.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder]
github_repository.repositories["namespace"]: Refreshing state... [id=namespace]
github_repository.repositories["mage-os-website"]: Refreshing state... [id=mage-os-website]
github_team_membership.members["Vinai_infrastructure"]: Refreshing state... [id=6847100:Vinai]
github_team_membership.members["Vinai_tech-lead"]: Refreshing state... [id=6847098:Vinai]
github_team_membership.members["sprankhub_distribution"]: Refreshing state... [id=6847101:sprankhub]
github_team_membership.members["johnhughes1984_content"]: Refreshing state... [id=6847102:johnhughes1984]
github_team_membership.members["Vinai_content"]: Refreshing state... [id=6847102:Vinai]
github_team_membership.members["mage-os-ci_continuous-integration"]: Refreshing state... [id=6847099:mage-os-ci]
github_team_membership.members["damienwebdev_infrastructure"]: Refreshing state... [id=6847100:damienwebdev]
github_team_membership.members["sprankhub_infrastructure"]: Refreshing state... [id=6847100:sprankhub]
github_team_membership.members["wigman_content"]: Refreshing state... [id=6847102:wigman]
github_team_membership.members["Vinai_distribution"]: Refreshing state... [id=6847101:Vinai]
github_branch_protection.mirrors["mirror-composer"]: Refreshing state... [id=BPR_kwDOHynKTc4By-d9]
github_branch_protection.mirrors["mirror-page-builder-types"]: Refreshing state... [id=BPR_kwDOGMKFF84By-dc]
github_branch_protection.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOG3Ro_84By-dJ]
github_branch_protection.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOG1y7C84By-d5]
github_branch_protection.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOG1y6y84By-df]
github_branch_protection.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOGMKAG84By-dP]
github_branch_protection.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOGMKCJ84By-dW]
github_branch_protection.mirrors["mirror-security-package"]: Refreshing state... [id=BPR_kwDOGMKCY84By-d1]
github_branch_protection.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOG8FefM4By-dZ]
github_branch_protection.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=BPR_kwDOIIQUpM4By-eH]
github_branch_protection.mirrors["mirror-inventory"]: Refreshing state... [id=BPR_kwDOGMKBz84By-dN]
github_branch_protection.mirrors["mirror-zf1"]: Refreshing state... [id=BPR_kwDOGMKC6M4By-d2]
github_branch_protection.mirrors["mirror-magento2"]: Refreshing state... [id=BPR_kwDOGHBHCc4By-d4]
github_branch_protection.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOG8L6gs4By-eB]
github_branch_protection.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=BPR_kwDOG3Rr984By-dH]
github_branch_protection.mirrors["mirror-adobe-ims"]: Refreshing state... [id=BPR_kwDOG8FV-s4By-dL]
github_branch_protection.mirrors["mirror-devdocs"]: Refreshing state... [id=BPR_kwDOGwaLE84By-dS]
github_branch_protection.repositories["mageos-magento2"]: Refreshing state... [id=BPR_kwDOH66Nbs4BysK-]
github_team_repository.teams["mageos-inventory-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-inventory-composer-installer]
github_branch_protection.repositories["terraform"]: Refreshing state... [id=BPR_kwDOHNQe7c4BysLD]
github_branch_protection.repositories["mageos-security-package"]: Refreshing state... [id=BPR_kwDOIShpTM4BzuWV]
github_branch_protection.repositories["infrastructure"]: Refreshing state... [id=BPR_kwDOGHBGY84BysK_]
github_branch_protection.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOISiqV84BzuWX]
github_branch_protection.repositories["mageos-inventory"]: Refreshing state... [id=BPR_kwDOIShsYM4BzuWO]
github_branch_protection.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOISihV84BzuWa]
github_branch_protection.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOISiM084BzuWR]
github_branch_protection.repositories["mageos-commerce-data-export"]: Refreshing state... [id=BPR_kwDOISixH84BzuWN]
github_branch_protection.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOISiZ3M4BzuWZ]
github_branch_protection.repositories["mage-os-website"]: Refreshing state... [id=BPR_kwDOGCTTT84BysLE]
github_branch_protection.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOISimRc4BzuWh]
github_branch_protection.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOISiVZc4BzuWM]
github_branch_protection.repositories["generate-mirror-repo-js"]: Refreshing state... [id=BPR_kwDOGta9mM4B0QmJ]
github_branch_protection.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOISivQc4BzuWP]
github_branch_protection.repositories["namespace"]: Refreshing state... [id=BPR_kwDOGIl6i84BysLC]
github_repository_file.codeowners["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/CODEOWNERS]
github_team_repository.teams["generate-mirror-repo-js_infrastructure"]: Refreshing state... [id=6847100:generate-mirror-repo-js]
github_team_repository.teams["infrastructure_infrastructure"]: Refreshing state... [id=6847100:infrastructure]
github_team_repository.teams["mageos-magento-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-magento-composer-installer]
github_team_repository.teams["mageos-magento2-sample-data_distribution"]: Refreshing state... [id=6847101:mageos-magento2-sample-data]
github_team_repository.teams["mageos-inventory_distribution"]: Refreshing state... [id=6847101:mageos-inventory]
github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-dependency-version-audit-plugin]
github_team_repository.teams["mage-os-website_content"]: Refreshing state... [id=6847102:mage-os-website]
github_team_repository.teams["mageos-commerce-data-export_distribution"]: Refreshing state... [id=6847101:mageos-commerce-data-export]
github_team_repository.teams["mageos-magento2_distribution"]: Refreshing state... [id=6847101:mageos-magento2]
github_team_repository.teams["mageos-security-package_distribution"]: Refreshing state... [id=6847101:mageos-security-package]
github_team_repository.teams["namespace_infrastructure"]: Refreshing state... [id=6847100:namespace]
github_team_repository.teams["mageos-composer-root-update-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-root-update-plugin]
github_team_repository.teams["mageos-adobe-stock-integration_distribution"]: Refreshing state... [id=6847101:mageos-adobe-stock-integration]
github_team_repository.teams["mageos-magento2-page-builder_distribution"]: Refreshing state... [id=6847101:mageos-magento2-page-builder]
github_repository_file.codeowners["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/CODEOWNERS]
github_repository_file.codeowners["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/CODEOWNERS]
github_repository_file.codeowners["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js/CODEOWNERS]
github_repository_file.codeowners["mageos-security-package"]: Refreshing state... [id=mageos-security-package/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/CODEOWNERS]
github_repository_file.codeowners["infrastructure"]: Refreshing state... [id=infrastructure/CODEOWNERS]
github_repository_file.codeowners["namespace"]: Refreshing state... [id=namespace/CODEOWNERS]
github_repository_file.codeowners["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/CODEOWNERS]
github_repository_file.codeowners["terraform"]: Refreshing state... [id=terraform/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory"]: Refreshing state... [id=mageos-inventory/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2"]: Refreshing state... [id=mageos-magento2/CODEOWNERS]
github_repository_file.codeowners["mage-os-website"]: Refreshing state... [id=mage-os-website/CODEOWNERS]
github_team_repository.tech-lead["mageos-magento-composer-installer"]: Refreshing state... [id=6847098:mageos-magento-composer-installer]
github_team_repository.tech-lead["generate-mirror-repo-js"]: Refreshing state... [id=6847098:generate-mirror-repo-js]
github_team_repository.tech-lead["mageos-adobe-stock-integration"]: Refreshing state... [id=6847098:mageos-adobe-stock-integration]
github_team_repository.tech-lead["terraform"]: Refreshing state... [id=6847098:terraform]
github_team_repository.tech-lead["mageos-security-package"]: Refreshing state... [id=6847098:mageos-security-package]
github_team_repository.tech-lead["mageos-commerce-data-export"]: Refreshing state... [id=6847098:mageos-commerce-data-export]
github_team_repository.tech-lead["mageos-inventory"]: Refreshing state... [id=6847098:mageos-inventory]
github_team_repository.tech-lead["mageos-magento2"]: Refreshing state... [id=6847098:mageos-magento2]
github_team_repository.tech-lead["mageos-magento2-sample-data"]: Refreshing state... [id=6847098:mageos-magento2-sample-data]
github_team_repository.tech-lead["infrastructure"]: Refreshing state... [id=6847098:infrastructure]
github_team_repository.tech-lead["namespace"]: Refreshing state... [id=6847098:namespace]
github_team_repository.tech-lead["mageos-inventory-composer-installer"]: Refreshing state... [id=6847098:mageos-inventory-composer-installer]
github_team_repository.tech-lead["mageos-composer-root-update-plugin"]: Refreshing state... [id=6847098:mageos-composer-root-update-plugin]
github_team_repository.tech-lead["mageos-magento2-page-builder"]: Refreshing state... [id=6847098:mageos-magento2-page-builder]
github_team_repository.tech-lead["mage-os-website"]: Refreshing state... [id=6847098:mage-os-website]
github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=6847098:mageos-composer-dependency-version-audit-plugin]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_branch_protection.repositories["generate-mirror-repo-js"] has changed
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDOGta9mM4B0QmJ"
      + push_restrictions               = []
        # (8 unchanged attributes hidden)


      ~ required_status_checks {
          + contexts = []
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # github_membership.users["Vinai"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"79735074d8acdd8e7c91e4da760308c7a0b8987a4a5347a614af13acea8dbb7d\"" -> "W/\"dcd6deb229d1b0275b9258b271b3fdabcb962705a4150c9b845a2c5f96892e85\""
        id       = "Mage-OS:Vinai"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["damienwebdev"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"c990dd646b7979b399e2f04d6fbc058b9605946360cc2e1b8f9d319f996fc93d\"" -> "W/\"4c73d51d3476439aeab5d87a99020daf9717ed73944e84de94001152247cce51\""
        id       = "Mage-OS:damienwebdev"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["johnhughes1984"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"34b66594ad059b9d4e5775a54b7ee8aa3d79552fd08893e2b865b1aefd9a58a8\"" -> "W/\"1e5767e106b67baf33ae8811a94bb8c2d85238ac534e6a7a0663bd4bc0959792\""
        id       = "Mage-OS:johnhughes1984"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["mage-os-ci"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"4628a6be1bb33a9d3ff9b531109baa2a9159f3d3ffb1ef25be25c093ad540d81\"" -> "W/\"fc0f42644ca30daf598bb004f84638ed621529366e33b7cb58a23634927301c6\""
        id       = "Mage-OS:mage-os-ci"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["sprankhub"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"2ed55076d613edcab5d72f9ae280e5955c24eff246ba71d41b0d6c71e3b6b5da\"" -> "W/\"131f8411bf6fadf8dbcbdf90b8ad634a9813f5c313767a7f9ed26a325ea19a64\""
        id       = "Mage-OS:sprankhub"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["wigman"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"f8d61a095cd053ed2309475b92289861967cedbaa1541d10ca501a88df991c78\"" -> "W/\"55a0c588c2559e764f0a65306762f3b4384792657e3595c8a19d4624ad518f77\""
        id       = "Mage-OS:wigman"
        # (2 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-commerce-data-export"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ branches               = [
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
        ]
      ~ etag                   = "W/\"6f4ff8e8709ad0ee3861b59bad3b4e80037ce94c79a2c37d54389c3b91f2c4ad\"" -> "W/\"a23116fad0df33cb6b8678286f09c17e2f1f2ac533f028ddfb20b1254e1ee62a\""
        id                     = "mirror-commerce-data-export"
        name                   = "mirror-commerce-data-export"
        # (26 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-magento2"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                   = "W/\"035f30ca501a2c036f534c0acc5daf2eed2ff4011ce829b3a77c5ea7c54cfdf9\"" -> "W/\"4dbf6e748ad850ed4272a890151c15e95209fcd275f3614ec2b38359f63f38e2\""
        id                     = "mirror-magento2"
        name                   = "mirror-magento2"
        # (27 unchanged attributes hidden)
    }

  # github_repository.repositories["generate-mirror-repo-js"] has changed
  ~ resource "github_repository" "repositories" {
      ~ branches               = [
            {
                name      = "23/nightly-integration-test"
                protected = false
            },
          ~ {
              ~ name      = "add-danslo-integrity-check-action" -> "add_mageos_nightly"
              ~ protected = false -> true
            },
          ~ {
              ~ name      = "integrity-complete" -> "add-danslo-integrity-check-action"
              ~ protected = false -> true
            },
          ~ {
              ~ name      = "main" -> "integrity-complete"
              ~ protected = false -> true
            },
          ~ {
              ~ name      = "nightly_builds_ci" -> "main"
              ~ protected = false -> true
            },
          + {
              + name      = "nightly_builds_ci"
              + protected = true
            },
        ]
      ~ description            = "Experimental JavaScript monorepo splitter implementation." -> "Mage-OS packaging implementation (JavaScript)"
      ~ etag                   = "W/\"4cb2a4f7dfa10156439f46170acea41ba9251cd05407db2f7bb96614bbe5f96f\"" -> "W/\"eb2ab3f21c64c335ad8b229efc4093fb0cd7d7d86bcf3081e2822a0782f04d1d\""
        id                     = "generate-mirror-repo-js"
        name                   = "generate-mirror-repo-js"
        # (25 unchanged attributes hidden)
    }

  # github_repository.repositories["mage-os-website"] has changed
  ~ resource "github_repository" "repositories" {
      ~ branches               = [
          + {
              + name      = "2022-11-02-update"
              + protected = true
            },
          + {
              + name      = "faq"
              + protected = true
            },
            {
                name      = "main"
                protected = true
            },
            # (1 unchanged element hidden)
        ]
      ~ etag                   = "W/\"f7b4310c83fc75e13d6f326f722260b30dad93ce5700bd038d09c878d71d065b\"" -> "W/\"9b2efcbaefa99d864900330b0987b08c3d784ae5f900634289b967a066c20244\""
      + homepage_url           = "mage-os-community.vercel.app"
        id                     = "mage-os-website"
        name                   = "mage-os-website"
        # (26 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-magento2"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                   = "W/\"68e0d2cb8ede00673d5d59d09252287c51c2a11de5b411d50c5464365eda9883\"" -> "W/\"b7c5029e447dc7abbb433008d63c2822bdc5b0a55295c81502aa96e6d0593557\""
        id                     = "mageos-magento2"
        name                   = "mageos-magento2"
        # (27 unchanged attributes hidden)
    }

  # github_team.teams["content"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"7b9a1433f2ad177641496c40aab3a74fabb78b0646367120b0830125708b929e\"" -> "W/\"7ee3ed10f7cb7901a194983c0f2f803a77133a50a4e2b4115eefca3980beac34\""
        id                        = "6847102"
        name                      = "content"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["continuous-integration"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"f49878299e96c25032f784c8bc2a62088eda38dc0bdc9c77f1a8cc407c729ed6\"" -> "W/\"61efe0a3d02c10cc6f1f6a9732658c724c8af0c94672fe128dde7c837ae46d08\""
        id                        = "6847099"
        name                      = "continuous-integration"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["distribution"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"772369a7ebfb5aa7535c0dc8efbc1f708a61c5590b1ad28037fbe9d93ecd306b\"" -> "W/\"15d3f203453e8c5f9fa5f0fcc5fe975308465e42d7fd817877abbe9a1e397ee6\""
        id                        = "6847101"
        name                      = "distribution"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["infrastructure"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"f2e8f23eabd33f3aa4760db7e4c744181596aec22767852d887d2a11cfe6bcb8\"" -> "W/\"62d6ac56dd6f23e1ce3806f1e05ab4d54373a3fa79e988a5a03b7ce13183268d\""
        id                        = "6847100"
        name                      = "infrastructure"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["tech-lead"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"e1a5e82f6375518772e4db2d1472b208c95219df886f6874a2313f7c04a3de62\"" -> "W/\"3ebce2e69b33455c4b5ca52cd2c5b56c0856d3633254b86d621bad5125ed354f\""
        id                        = "6847098"
        name                      = "tech-lead"
        # (6 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"d14017af5b13f5992577edc0622c856cf9a21708af430317dc20cc23eac21af0\"" -> "W/\"cd68efa46416b783975052b58fb3934a0410f30214ff9341d744dfb4c15146b6\""
        id       = "6847102:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"0f537db0aae9b404b21c3d90238145e904b3e38a7e5e98c0b30f5db1c18aaecf\"" -> "W/\"ea900100deb248a9d09413a16ea8ffdd5603589bed5a286104906d74d96c3aae\""
        id       = "6847101:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"e33da1a80a73fedb520492ff5cf123e3bbbfeeac1333d31e07b0faf6aeb6ca4e\"" -> "W/\"53701553975bc9eee95090fa44ccb5110b37e3add3beeaaa227240c0a6458928\""
        id       = "6847100:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_tech-lead"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"324509b8d02e252122cd5e215ff8b417f7bf18867dec592796818efb2a6f35c1\"" -> "W/\"1913b8e26906abbb82404c8cb599680dbec25013471f51516555fdce1ea2a8aa\""
        id       = "6847098:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["damienwebdev_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"7efb7c1e11897934498ee2c42810bab15fd9e1bb87a9120aa92a2208c2bd94d1\"" -> "W/\"4733146b17ce5ccbbaf3e82150e771d1901860f975dbfe4cbdc735f772baff45\""
        id       = "6847100:damienwebdev"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["johnhughes1984_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"ab31766b707dbf952854da1f794721fa3f03d84ec7dfc6ed607c734c535dbc8c\"" -> "W/\"9d2b207ecc20cca8de08e27a87d513d1a5db0c6d56ff6f8694252150f6bcfc50\""
        id       = "6847102:johnhughes1984"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["mage-os-ci_continuous-integration"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"0f3536c072f4782bc7c30c0a88ac28af041b60a572f021522cd9b88f970bbe03\"" -> "W/\"ae195cdad9062fde41c51f11389b296c52011699721c517b031ebed1f397b58a\""
        id       = "6847099:mage-os-ci"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"9716350982ae48393b041e6dc383ee9e04797094ee4c735a2d7f4a81cad7c5c6\"" -> "W/\"bf1f2c2447d23357aafc2b48081600a9facb4d1b6aa08146b3e97fe7de483485\""
        id       = "6847101:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"8207dfc01728f5049c4f70af28c223138136ce98e7c4ac8784e571988a3c5344\"" -> "W/\"597897d6298a41edf4a367fd10e7e12761c69bef282d8925ff000f06fa9d92a8\""
        id       = "6847100:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["wigman_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"aa2252f02620b2fcf86c8a8203913b3c7f522e3df3a857cc56c6a520dc79cadd\"" -> "W/\"2b63e1a5e41935fbb46360fe8de096b9a307815049da2f9e7cf93b89475aadca\""
        id       = "6847102:wigman"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["generate-mirror-repo-js_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"4a3d25ff8e703b428dedcdd8049468f6eaa5b118309740bb204ef05cadbc1bf4\"" -> "W/\"6e4f7118246ebb5cadb5b976e1acb88ad13f3e2d0b182126d8649a76435cc8fa\""
        id         = "6847100:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["infrastructure_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"cf99d6b1c0169ccaebbd54b4c071cd171a594b5aac2d1cc3735b1cfc2146761d\"" -> "W/\"6f1f3d3d4cac5a5f017b4d635c93e1c640d4a72436150038f6a3cdb1a54d28c4\""
        id         = "6847100:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mage-os-website_content"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"f7e19cb391cf6cdf33ac6dfe0152418db61836afa6dc05ddba04e7a762962b8e\"" -> "W/\"f33b2876003ab1c701a904e0cc1ff14acb4002aa6c94e22dc06b1fd3820d06dd\""
        id         = "6847102:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-adobe-stock-integration_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"d8077aaf6b4e95492ba849c1ff5207340bd17b5bc32854a373921678515ac871\"" -> "W/\"3ad98667fe5b1186ac424e880c49403908cef5adb243ddadf3bb2bdfb4b77c45\""
        id         = "6847101:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-commerce-data-export_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"e672a802f8281852fdbd90eb8b95c655e4108939cc07734fd630d9e78ec43304\"" -> "W/\"8b001ea35bf6418db1ac7c5e9686afdeac70ef7f308ea9a07253f65bec0f2b4b\""
        id         = "6847101:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"a46c46cc486278c18627b55468c98f286fab58129ed804d967912e65164d66c6\"" -> "W/\"7d0069c530b0ab54f25f337b0d0fbc153f23d3c11ad3497cc41bfa4dc01f334d\""
        id         = "6847101:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-root-update-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"8f3c7056b5a343d587bbcef8ec442aeda57fd81ab16b3f0038c1a49437de80d3\"" -> "W/\"20c450137987d9592899eca0c619a682e6dde0f5e6c6fbb28498f14536c24f02\""
        id         = "6847101:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"fc233a713e18df79b868344bf7060f0dc2776757346fed27cb589bda9b5b150b\"" -> "W/\"a2b1292008745acedb8d99606ec01bbebad1b593b2877dc45710b8a71618217d\""
        id         = "6847101:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"99ac2b43b8dc0bd908743bf92b4b6df78f2b92542cdfe71399ed8a65b7424d92\"" -> "W/\"4e92fe31d2b7c7ee6c9be8a6f30b81b5348ccce68fc73674a88bbdceacf126fe\""
        id         = "6847101:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"61a7a3cf9acb2ab2d3f051f5f13fec2a5ddd8b3d36a29a5a63e180814b7a5e15\"" -> "W/\"08327c633543cb6483bd845fbf147cd112059a555a950ad5cf104bc0c04276d2\""
        id         = "6847101:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-page-builder_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"6f2c0398ea24a8fd60e123f014705be81e4105c2dba9e03b66a82550171a2b7e\"" -> "W/\"1e1d32680e25e5ff6fc74999b0368eb91fd555d20e34c9b6d753d680c099818b\""
        id         = "6847101:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-sample-data_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"5110765936fb931bb51d087a6e2a4ecbd495aad7b03ae826a5276b8f53ae4498\"" -> "W/\"5b944e5beabb795ecf95ccb0384ee906e8e3f938932ba36e2642407736fd6156\""
        id         = "6847101:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"e160b42b0ebd8ef5dca28bdc6c512173e3ac94215bec94e76f5df609cb70fd8b\"" -> "W/\"5b9e77f424409010489dd636883f118304c77941bae87bc7a4d53d2f491f66b5\""
        id         = "6847101:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-security-package_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"4bcfc86736a54be427f206e6a768692668b32fbc79e390415407a60a6fb3f18a\"" -> "W/\"13d67f3e0fc89775a63710a0c43ba2afa622642831722ddf15307d85c5396f1c\""
        id         = "6847101:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["namespace_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"6105e214e3edc72be7cec3a1e85b160557bc1f9f5140b0acfe1a97c6f82d66b9\"" -> "W/\"d5ee931cdf9ef2266ee9c51527a77a297164b5132f5b2fae2fa750242dc5be85\""
        id         = "6847100:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["generate-mirror-repo-js"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"de78c1d248e873accdf92e4005376319bfbdf698f207968cf5c2c5a18fcb7904\"" -> "W/\"e3c735987a05e69dd0b1b48db0fb4a597aca6b44d406ace9f5d20ae682809f42\""
        id         = "6847098:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["infrastructure"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"6664c3b8d75e8fd0519fe0b218ba31a4b577505e8931105149ffab1502c9e29d\"" -> "W/\"5cb5aa4a906447558cce43f57cd0f925683546cbe777bf5f2e0dbf6a500f92f8\""
        id         = "6847098:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mage-os-website"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"8f8e0be45b126a117f3661eb0352865b1655a20da5736647f75466b5f6e08008\"" -> "W/\"df54604080a45211154c91740bf4856c763b9082aea8729958b37a4c9218895d\""
        id         = "6847098:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-adobe-stock-integration"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"74f56a4c9c07a40722e5cafa1acd651eec072b20af57b5f4a9160a82e7555395\"" -> "W/\"3bfdf270a23026c90bb1c4c491038bb400d9d94a572f9732998c34b1f880df97\""
        id         = "6847098:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-commerce-data-export"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"266c4599ca7055ffd3f94b457361c914390d1dd920d9b413033dd70cd6dc0549\"" -> "W/\"4a91a97e95e03b10b075226bb40df73fd329560022acbfc4afcb8f8ae358fc71\""
        id         = "6847098:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"040651f269950f07f437804e50b1580fc29c3cf4147c888c5a8af95fbb0f9e31\"" -> "W/\"c11522451b43b3c51cff43c3084a322140b746c42e1fe4fc557d909c11d395f5\""
        id         = "6847098:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-root-update-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"215f42455280915f3d5cfdec3077f4d2f4916d9b275cd6739c1e8dc2e0c9186f\"" -> "W/\"4b1796a6081a043fa57d2d2c9c0534fb91526ed7e44bae2a8a871f2604dd00af\""
        id         = "6847098:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"3a50c808c59a82ca84f4b27b6ad648803ee17e414ea418c5f44536f0cef8a0c0\"" -> "W/\"69771de0ebe992d9366ff14172cee475db4014273733025d7a2a4843a3067dc7\""
        id         = "6847098:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"0e63887de46c5775e411c2e08e16feaab8ad27d603c865d0f32aa5931428432c\"" -> "W/\"2d5995b47d4bb98bc11be3161c5e909965a9ca4d489366900369e0df067619da\""
        id         = "6847098:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"957669fa955af81db20602cb18b05772a60ce906443a00de6acfd51b93689486\"" -> "W/\"d59a2d4cc9b2b87925d3ea4aaf095a43907c96ea8492fa648443da583c56eb98\""
        id         = "6847098:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"0b1b55a016bcb9c5b7655cae7f44af764b74779a8a263be91517fc0c1f8d2a05\"" -> "W/\"e6fdb874b20cbe0841d6e7ea1c838898ce6dda830d2de893390a0799829b1257\""
        id         = "6847098:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-page-builder"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"310ede0235ab3fef77df9adb460c6aa39963cd68d3e241de636c43a26fd73146\"" -> "W/\"35db5698d9a37c3483efeaaf648533da1e9baf6d38d914cd326043fec2185139\""
        id         = "6847098:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-sample-data"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"4fb592c494d55625ec771256c3bf0bbaf99ff2e825767560bfc3a1a89f54534d\"" -> "W/\"302995ef74bf0533b01bae0e596bd8a4d8253fc969f0813aa4c42ea6070f076c\""
        id         = "6847098:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-security-package"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"f5911dcf6e546f05eb33b79baa864ce386ad8ffa8282243ff496c9404e7828c5\"" -> "W/\"307cf63879db4a788157127fdbdec395fb89df49848c411e234974405876ce1e\""
        id         = "6847098:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["namespace"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"683bd5eb5f13c986c044fadd98fe038b08df2405f87c8cf986a16430a28b6719\"" -> "W/\"1cb3508b3ce321c305a1a154f1be17c43e46bb96207ae39ae152cb66b570d7b0\""
        id         = "6847098:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["terraform"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"25cec35e524dccebcd2ea5f5d9de5b6c0d5240b4a56244f001f2f4afbc49c187\"" -> "W/\"2756282466526317a9ba34c8745681cb89989984a741d2682d0ad8acf90f6b0e\""
        id         = "6847098:terraform"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.mirrors["mirror-commerce-admin.en"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + push_restrictions               = [
          + "U_kgDOBfjDkQ",
        ]
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_branch_protection.mirrors["mirror-commerce-operations.en"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + push_restrictions               = [
          + "U_kgDOBfjDkQ",
        ]
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_repository.mirrors["mirror-commerce-admin.en"] will be created
  + resource "github_repository" "mirrors" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror of https://github.com/AdobeDocs/commerce-admin.en."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-commerce-admin.en"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.mirrors["mirror-commerce-operations.en"] will be created
  + resource "github_repository" "mirrors" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror of https://github.com/AdobeDocs/commerce-operations.en."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-commerce-operations.en"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["generate-mirror-repo-js"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ description            = "Mage-OS packaging implementation (JavaScript)" -> "Mage-OS packaging implementation (JavaScript)."
        id                     = "generate-mirror-repo-js"
        name                   = "generate-mirror-repo-js"
        # (27 unchanged attributes hidden)
    }

  # github_repository.repositories["mage-os-website"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      - homepage_url           = "mage-os-community.vercel.app" -> null
        id                     = "mage-os-website"
        name                   = "mage-os-website"
        # (28 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Issuer: @sprankhub, Action: https://github.com/mage-os/terraform/actions/runs/3409535454